jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_sdk17.0/main.c
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


// /**@brief Function for handling the data from the Nordic UART Service.
//  *
//  * @details This function will process the data received from the Nordic UART BLE Service and send
//  *          it to the UART module.
//  *
//  * @param[in] p_evt       Nordic UART Service event.
//  */
// /**@snippet [Handling the data received over BLE] */
// static void nus_data_handler(ble_nus_evt_t * p_evt)
// {
//
//         if (p_evt->type == BLE_NUS_EVT_RX_DATA)
//         {
//                 uint32_t err_code;
//
//                 NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
//                 NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
//
//                 for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
//                 {
//                         do
//                         {
//                                 err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
//                                 if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
//                                 {
//                                         NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
//                                         APP_ERROR_CHECK(err_code);
//                                 }
//                         } while (err_code == NRF_ERROR_BUSY);
//                 }
//                 if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
//                 {
//                         while (app_uart_put('\n') == NRF_ERROR_BUSY);
//                 }
//         }
//
// }
/**@snippet [Handling the data received over BLE] */

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

        if (p_evt->type == BLE_NUS_EVT_RX_DATA)
        {
                uint32_t err_code;

                NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
                NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

                for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
                {
                        do
                        {
                                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                                {
                                        NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                                        APP_ERROR_CHECK(err_code);
                                }
                        } while (err_code == NRF_ERROR_BUSY);
                }
                if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
                {
                        while (app_uart_put('\n') == NRF_ERROR_BUSY);
                }
        }

}
/**@snippet [Handling the data received over BLE] */


static void its_evt_handler(ble_its_t *p_its, ble_its_evt_t const *p_its_evt)
{
        switch (p_its_evt->evt_type)
        {
        case BLE_ITS_EVT_ITS_RX_DATA_EVT:
                break;
        default:
                break;
        }
}

static void fts_evt_handler(ble_fts_t *p_fts, ble_fts_evt_t const *p_fts_evt)
{
        switch (p_fts_evt->evt_type)
        {
        case BLE_FTS_EVT_TX_CMD_READY:
                NRF_LOG_INFO("BLE_FTS_EVT_TX_CMD_READY");
                break;
        case BLE_FTS_EVT_TX_DATA_READY:
                NRF_LOG_INFO("BLE_FTS_EVT_TX_DATA_READY");
                break;
        case BLE_FTS_EVT_TX_DATA_COMPLETE: /**< Event indicating that the central has received something from a peer. */
                break;
        case BLE_FTS_EVT_RX_CMD_RECEIVED: /**< Event indicating that the central has received something from a peer. */
                NRF_LOG_DEBUG("BLE_FTS_EVT_RX_CMD_RECEIVED");
                NRF_LOG_HEXDUMP_DEBUG(p_fts_evt->p_data, p_fts_evt->data_len);
                {
                        memcpy(&m_application_state.psr, p_fts_evt->p_data, p_fts_evt->data_len);//get_packet_success_rate();
                        display_update();
                }

                break;

        case BLE_FTS_EVT_RX_DATA_RECEIVED: /**< Event indicating that the central has written to peripheral. */
                NRF_LOG_INFO("BLE_FTS_EVT_RX_DATA_RECEIVED");
                NRF_LOG_HEXDUMP_INFO(p_fts_evt->p_data, p_fts_evt->data_len);
                break;
        case BLE_FTS_EVT_RX_DATA_COMPLETE: /**< Event indicating that the central has written to peripheral completely. */
                break;
        case BLE_FTS_EVT_CONNECTED: /**< Event indicating that the NUS server has disconnected. */
                NRF_LOG_INFO("BLE_FTS_EVT_CONNECTED");
                break;
        case BLE_FTS_EVT_DISCONNECTED:              /**< Event indicating that the NUS server has disconnected. */
                break;

        default:
                break;
        }
}

static void its_service_init(void)
{
        uint32_t err_code;
        ble_its_init_t its_init;
        memset(&its_init, 0, sizeof(its_init));
        // Initialize ITS.
        its_init.evt_handler = its_evt_handler;
        err_code = ble_its_init(&m_its, &its_init);
        APP_ERROR_CHECK(err_code);
}

static void nus_service_init(void)
{
        uint32_t err_code;
        ble_nus_init_t nus_init;
        // Initialize NUS.
        memset(&nus_init, 0, sizeof(nus_init));
        nus_init.data_handler = nus_data_handler;
        err_code = ble_nus_init(&m_nus, &nus_init);
        APP_ERROR_CHECK(err_code);
}

