jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_sdk17.0/main.c
static void fts_service_init(void)
{
        uint32_t err_code;
        ble_fts_init_t fts_init;
        memset(&fts_init, 0, sizeof(fts_init));
        // Initialize file transfer service.
        fts_init.evt_handler = fts_evt_handler;
        err_code = ble_fts_init(&m_fts, &fts_init);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
        uint32_t err_code;

        nrf_ble_qwr_init_t qwr_init = {0};

        // Initialize Queued Write Module.
        qwr_init.error_handler = nrf_qwr_error_handler;

        err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
        APP_ERROR_CHECK(err_code);

        its_service_init();
        nus_service_init();
        fts_service_init();
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
        uint32_t err_code;

        if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
        {
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                APP_ERROR_CHECK(err_code);
        }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
        uint32_t err_code;
        ble_conn_params_init_t cp_init;

        memset(&cp_init, 0, sizeof(cp_init));

        cp_init.p_conn_params                  = NULL;
        cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
        cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
        cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
        cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        cp_init.disconnect_on_fail             = false;
        cp_init.evt_handler                    = on_conn_params_evt;
        cp_init.error_handler                  = conn_params_error_handler;

        err_code = ble_conn_params_init(&cp_init);
        APP_ERROR_CHECK(err_code);
}


/****************************************************************/
static void Get_Connect_MAC_Address(ble_gap_addr_t *gap_address)
{
        NRF_LOG_INFO("Connected to ESL address to: %02X:%02X:%02X:%02X:%02X:%02X",
                     gap_address->addr[5],
                     gap_address->addr[4],
                     gap_address->addr[3],
                     gap_address->addr[2],
                     gap_address->addr[1],
                     gap_address->addr[0]);
}

/**@brief Function for handling BLE_GAP_EVT_CONNECTED events.
 * Save the connection handle and GAP role.
 * Turn on the "connected state" LED.
 */
static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt)
{
        ret_code_t err_code;

        m_conn_handle = p_gap_evt->conn_handle;
        m_gap_role    = p_gap_evt->params.connected.role;

        int8_t tx_power = (int8_t)(m_application_state.tx_power * 4);

        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_INFO("on_ble_gap_evt_connected TX Power = %d", tx_power);

        if (m_gap_role == BLE_GAP_ROLE_PERIPH)
        {
                NRF_LOG_INFO("Connected as a peripheral.");
        }
        else if (m_gap_role == BLE_GAP_ROLE_CENTRAL)
        {
                NRF_LOG_INFO("Connected as a central. Should not happen.");
        }

        //If advertising, stop advertising.
        (void) sd_ble_gap_adv_stop(m_adv_handle);

}

/**@brief Function for handling BLE_GAP_EVT_DISCONNECTED events.
 * Unset the connection handle and restart advertising if needed.
 */
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const * p_gap_evt)
{
        m_conn_handle = BLE_CONN_HANDLE_INVALID;
        m_waiting_for_disconnect_evt = false;

        NRF_LOG_DEBUG("Disconnected: reason 0x%x.", p_gap_evt->params.disconnected.reason);

        if (m_app_initiated_disconnect == false) // (If a the app itself (button push) has initiated a disconnect, bsp_evt_handler will start the advertising.)
        {
                // Start advertising with the current setup.
                bsp_board_leds_off();
        }

}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
        uint32_t err_code;

        ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:

                NRF_LOG_INFO("Connected: %i", p_ble_evt->evt.gap_evt.conn_handle);

                err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
                APP_ERROR_CHECK(err_code);
                m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
                APP_ERROR_CHECK(err_code);

                on_ble_gap_evt_connected(p_gap_evt);

                err_code = sd_ble_gap_rssi_start(p_ble_evt->evt.gap_evt.conn_handle, 1, 2);
                APP_ERROR_CHECK(err_code);

                // NRF_LOG_HEXDUMP_INFO(p_gap_evt->params.connected.peer_addr.addr, 6);
                Get_Connect_MAC_Address((ble_gap_addr_t *)&p_gap_evt->params.connected.peer_addr);

                packet_error_rate_reset_counter();
                packet_error_rate_detect_enable();

                m_application_state.app_state = APP_STATE_CONNECTED;
                display_update();

                break;

        case BLE_GAP_EVT_DISCONNECTED:
                NRF_LOG_INFO("Disconnected. conn_handle: 0x%x, reason: 0x%x",
                             p_gap_evt->conn_handle,
                             p_gap_evt->params.disconnected.reason);


